# Вычислить число c заданной точностью d

# Пример:

# - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$



value =float(input("введите число: "))
ds=int(input("введите степень точности d=10^-"))

if (0<ds<11): print(round(value,ds))
else:print("10^(-1) ≤ d ≤10^(-10)")
